Revit 2024 API
InitialWattageIntensity Constructor (InitialWattageIntensity)
 Creates a copy of the given initial wattage intensity object
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public InitialWattageIntensity(
	InitialWattageIntensity other
)
Visual Basic
Public Sub New ( _
	other As InitialWattageIntensity _
)
Visual C++
public:
InitialWattageIntensity(
	InitialWattageIntensity^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Lighting.InitialWattageIntensity
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
InitialWattageIntensity Class
InitialWattageIntensity Overload
Autodesk.Revit.DB.Lighting Namespace